GETOBJUC: +
  PGM PARM(&OBJECT &TYPE &MEMBER &RETMSG &RETMSGFLD &RETFILE)

/* -----------------------------------------------------------------*/
/* This program finds all the jobs which are using an object.       */
/* It returns a message suitable for display to the operator        */
/* and/or  file QTEMP/GETOBJUP listing all jobs.  This file         */
/* could be used to send a message to all users of the object.      */
/* -----------------------------------------------------------------*/
/* Use the GETOBJUSR command to invoke this program                 */
/* -----------------------------------------------------------------*/
/* 11/24/97 LENNON Original writing                                 */
/* -----------------------------------------------------------------*/
/* 10/05/2001 Sam Lennon. If a non file object is locked *EXCL then */
/*            RTVOBJD to get real library name to put in the        */
/*            message fails. If this occurs, just continue and      */
/*            *LIBL may appear in the message.                      */
/* -----------------------------------------------------------------*/
/* 02/--/2024 CPF7306 to allow for SQL created GETOBJUP member      */
/* -----------------------------------------------------------------*/
/* 09/--/2026 Validate the parameters and check object existence    */
/*            and *USE authority before using them.                 */
/* -----------------------------------------------------------------*/

/* Input parameters */
  DCL VAR(&OBJECT)     TYPE(*CHAR) LEN(20)    /* Obj & lib */
  DCL VAR(&TYPE)       TYPE(*CHAR) LEN(10)    /* Obj type  */
  DCL VAR(&MEMBER)     TYPE(*CHAR) LEN(10)    /* if *FILE */
  DCL VAR(&RETMSG)     TYPE(*CHAR) LEN(4)     /* Return a msg? */
  DCL VAR(&RETMSGFLD)  TYPE(*CHAR) LEN(200)   /* Fld for msg */
  DCL VAR(&RETFILE)    TYPE(*CHAR) LEN(4)     /* Return a file? */

/* Variables used in this program */
  DCL VAR(&OBJNAM)     TYPE(*CHAR) LEN(10)    /* Obj name  */
  DCL VAR(&OBJLIB)     TYPE(*CHAR) LEN(10)    /* Obj lib   */
  DCL VAR(&FRMOBJLIB)  TYPE(*CHAR) LEN(10)    /* For duping file */
  DCL VAR(&FAKMSGFLD)  TYPE(*CHAR) LEN(1)     /* No msg fld passed */

/* Parameter validation variables */
  DCL VAR(&LASTPOS)    TYPE(*DEC)  LEN(5 0)   /* Last non blank */
  DCL VAR(&WORK)       TYPE(*CHAR) LEN(10)    /* Name being checked */
  DCL VAR(&SRCHTYPE)   TYPE(*CHAR) LEN(11)    /* "/" + object type */
  DCL VAR(&ERRTEXT)    TYPE(*CHAR) LEN(132)   /* Validation error */
  DCL VAR(&VALIDCHR)   TYPE(*CHAR) LEN(42) +
     VALUE('ABCDEFGHIJKLMNOPQRSTUVWXYZ0123456789$#@_.*')

/* Supported object types. Each type occupies an 11 byte slot   */
/* made up of "/" followed by the type padded to 10 bytes. The  */
/* list matches the VALUES list of the GETOBJUSR command.       */
  DCL VAR(&TYPELIST)  TYPE(*CHAR) LEN(847) +
     VALUE('/*ALRTBL   /*AUTL     /*BNDDIR   /*CFGL     /*CHTF+
     MT   /*CLD      /*CLS      /*CMD      /*CNNL     /+
     *COSD     /*CRQD     /*CSI      /*CSPMAP   /*CSPTB+
     L   /*CTLD     /*DEVD     /*DOC      /*DTAARA   /*+
     DTADCT   /*DTAQ     /*EDTD     /*EXITRG   /*FC+
     T      /*FILE     /*FLR      /*FNTRSC   /*FNTTB+
     L   /*FORMDF   /*FTR      /*GSS      /*IPXD     /*+
     JOBD     /*JOBQ     /*JOBSCD   /*JRN      /*JRNRC+
     V   /*LIB      /*LIND     /*LOCALE   /*MENU     /*+
     MODD     /*MODULE   /*MSGF     /*MSGQ     /*M3+
     6      /*M36CFG   /*NODL     /*NTBD     /*NWI+
     D     /*NWSD     /*OUTQ     /*OVL      /*PAGDF+
     N   /*PAGSEG   /*PDG      /*PGM      /*PNLGRP   /*+
     PRDAVL   /*PRDDFN   /*PRDLOD   /*PSFCFG   /*QMFOR+
     M   /*QMQRY    /*QRYDFN   /*SBSD     /*SCHIDX   /*+
     SPADCT   /*SQLPKG   /*SRVPGM   /*SSND     /*S3+
     6      /*TBL      /*USRIDX   /*USRPRF   /*USR+
     Q     /*USRSPC   /*WSCST    ')

 /* Error Handling Variables */
  DCL VAR(&E_MSGID)    TYPE(*CHAR) LEN(7)
  DCL VAR(&E_MSGF)     TYPE(*CHAR) LEN(10)
  DCL VAR(&E_MSGFLIB)  TYPE(*CHAR) LEN(10)
  DCL VAR(&E_MSGDTA)   TYPE(*CHAR) LEN(100)

/* Catch unmonitored errors */
  MONMSG MSGID(CPF0000) EXEC(GOTO CMDLBL(ERROR))

/* Validate the parameters before they are used to access objects */
  CHGVAR VAR(&OBJNAM) VALUE(%SST(&OBJECT 1 10))
  CHGVAR VAR(&OBJLIB) VALUE(%SST(&OBJECT 11 10))

/* Object name: required, no embedded blanks or odd characters */
  CHGVAR VAR(&LASTPOS) VALUE(%CHECKR(' ' &OBJNAM))
  IF COND(&LASTPOS *EQ 0) THEN(DO)
      CHGVAR VAR(&ERRTEXT) VALUE('GETOBJUSR: Object name is required.')
      GOTO CMDLBL(PARMERR)
  ENDDO
  CHGVAR VAR(&WORK) VALUE('AAAAAAAAAA')
  CHGVAR VAR(%SST(&WORK 1 &LASTPOS)) +
     VALUE(%SST(&OBJNAM 1 &LASTPOS))
  IF COND(%CHECK(&VALIDCHR &WORK) *NE 0) THEN(DO)
      CHGVAR VAR(&ERRTEXT) +
         VALUE('GETOBJUSR: Invalid object name: ' *CAT &OBJNAM)
      GOTO CMDLBL(PARMERR)
  ENDDO

/* Library name: required, no embedded blanks or odd characters */
  CHGVAR VAR(&LASTPOS) VALUE(%CHECKR(' ' &OBJLIB))
  IF COND(&LASTPOS *EQ 0) THEN(DO)
      CHGVAR VAR(&ERRTEXT) VALUE('GETOBJUSR: Library is required.')
      GOTO CMDLBL(PARMERR)
  ENDDO
  CHGVAR VAR(&WORK) VALUE('AAAAAAAAAA')
  CHGVAR VAR(%SST(&WORK 1 &LASTPOS)) +
     VALUE(%SST(&OBJLIB 1 &LASTPOS))
  IF COND(%CHECK(&VALIDCHR &WORK) *NE 0) THEN(DO)
      CHGVAR VAR(&ERRTEXT) +
         VALUE('GETOBJUSR: Invalid library name: ' *CAT &OBJLIB)
      GOTO CMDLBL(PARMERR)
  ENDDO

/* Object type: must be one of the supported object types */
  CHGVAR VAR(&SRCHTYPE) VALUE('/' *CAT &TYPE)
  IF COND(%SCAN(&SRCHTYPE &TYPELIST) *EQ 0) THEN(DO)
      CHGVAR VAR(&ERRTEXT) +
         VALUE('GETOBJUSR: Invalid object type: ' *CAT &TYPE)
      GOTO CMDLBL(PARMERR)
  ENDDO

/* Member: only meaningful, and required, for *FILE objects */
  IF COND(&TYPE *EQ '*FILE') THEN(DO)
      CHGVAR VAR(&LASTPOS) VALUE(%CHECKR(' ' &MEMBER))
      IF COND(&LASTPOS *EQ 0) THEN(DO)
          CHGVAR VAR(&ERRTEXT) +
             VALUE('GETOBJUSR: Member is required for *FILE.')
          GOTO CMDLBL(PARMERR)
      ENDDO
      CHGVAR VAR(&WORK) VALUE('AAAAAAAAAA')
      CHGVAR VAR(%SST(&WORK 1 &LASTPOS)) +
         VALUE(%SST(&MEMBER 1 &LASTPOS))
      IF COND(%CHECK(&VALIDCHR &WORK) *NE 0) THEN(DO)
          CHGVAR VAR(&ERRTEXT) +
             VALUE('GETOBJUSR: Invalid member name: ' *CAT &MEMBER)
          GOTO CMDLBL(PARMERR)
      ENDDO
  ENDDO

/* The object must exist and the caller must be authorized to it */
  CHKOBJ OBJ(&OBJLIB/&OBJNAM) OBJTYPE(&TYPE) AUT(*USE)
  MONMSG MSGID(CPF9803) /*Locked - that is what we report on*/
  MONMSG MSGID(CPF9801 CPF9802 CPF9810 CPF9815) EXEC(DO)
      CHGVAR VAR(&ERRTEXT) +
         VALUE('GETOBJUSR: Not found or not authorized: ' *CAT +
         &OBJNAM)
      GOTO CMDLBL(PARMERR)
  ENDDO

/* Convert *LIBL/*CURLIB into a real name, if possible     */
  RTVOBJD OBJ(&OBJLIB/&OBJNAM) OBJTYPE(&TYPE) RTNLIB(&OBJLIB)
  MONMSG MSGID(CPF9803) EXEC(DO) /*Cannot Allocate*/
      GOTO       CMDLBL(PASTLIBGET)
  ENDDO
  CHGVAR VAR(%SST(&OBJECT 11 10)) VALUE(&OBJLIB)
  PASTLIBGET: +

/* If output file requested, create empty file in QTEMP */
  IF COND(&RETFILE = '*YES') THEN(DO)
      DLTF FILE(QTEMP/GETOBJUP)
      MONMSG MSGID(CPF2105) /* not found */
      RTVOBJD OBJ(*LIBL/GETOBJUP) OBJTYPE(*FILE) RTNLIB(&FRMOBJLIB)
      CRTDUPOBJ OBJ(GETOBJUP) FROMLIB(&FRMOBJLIB) OBJTYPE(*FILE) +
         TOLIB(QTEMP)
      ADDPFM FILE(QTEMP/GETOBJUP) MBR(GETOBJUP)
      MONMSG MSGID(CPF7306)
      OVRDBF FILE(GETOBJUP) TOFILE(QTEMP/GETOBJUP) SECURE(*YES)
  ENDDO

/* Call RPG program to find the users */
  IF COND(&RETMSG = '*YES') THEN(DO)
      CALL PGM(GETOBJUR) PARM(&OBJECT &TYPE &MEMBER &RETMSG +
         &RETMSGFLD &RETFILE)
  ENDDO
  ELSE CMD(DO)
      CALL PGM(GETOBJUR) PARM(&OBJECT &TYPE &MEMBER &RETMSG +
         &FAKMSGFLD &RETFILE)
  ENDDO

/* End of program */
  GOTO CMDLBL(ENDPGM)

/* Parameter validation failed - tell the caller what was wrong */
PARMERR: +
  SNDPGMMSG MSGID(CPF9898) MSGF(QCPFMSG) MSGDTA(&ERRTEXT) +
     MSGTYPE(*ESCAPE)
  MONMSG MSGID(CPF0000) /* Just in case */
  GOTO CMDLBL(ENDPGM)

/* Error handler - resend any trapped escape message */
ERROR: +
  RCVMSG MSGTYPE(*LAST) MSGDTA(&E_MSGDTA) MSGID(&E_MSGID) +
     MSGF(&E_MSGF) MSGFLIB(&E_MSGFLIB)
  MONMSG MSGID(CPF0000) /* Just in case */
  SNDPGMMSG MSGID(&E_MSGID) MSGF(&E_MSGFLIB/&E_MSGF) +
     MSGDTA(&E_MSGDTA) MSGTYPE(*ESCAPE)
  MONMSG MSGID(CPF0000) /* Just in case */
ENDPGM: +
  ENDPGM
